---
kind: type
id: T:Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
source: html/e4da0a34-f75b-2c48-45c4-cd3c82aaba89.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator

An iterator to a voltage type set.

## Syntax (C#)
```csharp
public abstract class VoltageTypeSetIterator : APIObject,
	IEnumerator
```